tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "antigen"
brew "bat"
brew "docker"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "make"
brew "mas"
brew "nano"
brew "node"
brew "pyenv"
brew "starship"
brew "docker-compose"
brew "go-task"
brew "qrencode"
brew "gnupg"
brew "jq"

cask "slack"
cask "alt-tab"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "gray"
cask "iterm2"
cask "microsoft-teams"
cask "ngrok"
cask "onedrive"
cask "postman"
cask "rectangle"
cask "scroll-reverser"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
cask "warp"

mas "Amphetamine", id: 937984704
mas "reMarkable", id: 1276493162
mas "Microsoft Outlook", id: 985367838

vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "akamud.vscode-theme-onedark"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "codewithshashank.svg-to-jsx"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "github.vscode-github-actions"
vscode "irongeek.vscode-env"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "simonsiefke.svg-preview"
vscode "solnurkarim.html-to-css-autocompletion"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tobiasalthoff.atom-material-theme"
vscode "tyriar.lorem-ipsum"
vscode "william-voyek.vscode-nginx"
vscode "wix.glean"
vscode "zhuangtongfa.material-theme"