tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

brew "antigen"
brew "bat"
brew "docker"
brew "findutils"
brew "fzf"
brew "gh"
brew "git"
brew "make"
brew "mas"
brew "nano"
brew "node"
brew "pyenv"
brew "starship"
brew "docker-compose"
brew "go-task"

cask "slack"
cask "alt-tab"
cask "firefox"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "gray"
cask "iterm2"
cask "microsoft-teams"
cask "ngrok"
cask "onedrive"
cask "postman"
cask "rectangle"
cask "scroll-reverser"
cask "spotify"
cask "visual-studio-code"
cask "vlc"