tap "hashicorp/tap"
tap "homebrew/bundle"

brew "act"
brew "antigen"
brew "openssl@3"
brew "bat"
brew "coreutils"
brew "docker-completion"
brew "findutils"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go-task"
brew "jq"
brew "make"
brew "mas"
brew "nano"
brew "node"
brew "oauth2l"
brew "pinentry-mac"
brew "pyenv"
brew "qrencode"
brew "starship"
brew "hashicorp/tap/terraform"

cask "alt-tab"
cask "docker-desktop"
cask "firefox"
cask "font-hack-nerd-font"
cask "ghostty"
cask "google-chrome"
cask "gray"
cask "maccy"
cask "microsoft-teams"
cask "ngrok"
cask "obsidian"
cask "onedrive"
cask "postman"
cask "proton-pass"
cask "rectangle"
cask "scroll-reverser"
cask "slack"
cask "spotify"
cask "tailscale-app"
cask "visual-studio-code"

mas "Amphetamine", id: 937984704
mas "Microsoft Outlook", id: 985367838
mas "reMarkable", id: 1276493162
mas "Slack", id: 803453959

vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "akamud.vscode-theme-onedark"
vscode "ambooth.git-rename"
vscode "austenc.tailwind-docs"
vscode "bierner.markdown-mermaid"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "codewithshashank.svg-to-jsx"
vscode "codezombiech.gitignore"
vscode "continue.continue"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-close-tag"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "hdoro.sanity-snippets"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "redhat.vscode-yaml"
vscode "sanity-io.vscode-sanity"
vscode "simonsiefke.svg-preview"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "william-voyek.vscode-nginx"
vscode "wix.glean"